xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/User/Command/cmd_apollo2.h
#ifndef __CMD_APOLLO2_H__
#define __CMD_APOLLO2_H__

#include <stdint.h>
#if defined(LAYER_APPLICATION )
#include "watch_config.h"
#endif

#define UART_PACKET_HEADER				(0xA5)


#define PC_UART_CCOMMAND_MASK_BOOTLOADER_POSITION             (8)
#define PC_UART_CCOMMAND_MASK_APPLICATION_POSITION            (9)
#define PC_UART_CCOMMAND_MASK_UPDATE_ALGORITHM_POSITION       (10)
#define PC_UART_CCOMMAND_MASK_HARDWARE_TEST_POSITION          (11)
#define BLE_UART_CCOMMAND_MASK_APP_POSITION                    (12)





#define BLE_UART_CCOMMAND_MASK_BOOTLOADER                                  ((1<<PC_UART_CCOMMAND_MASK_BOOTLOADER_POSITION)<<8|(UART_PACKET_HEADER))

#define BLE_UART_CCOMMAND_BOOTLOADER_UNSPPORT       		            			 (0xFF<<8)





#define BLE_UART_CCOMMAND_BOOTLOADER_BLE_INFO                              (0x21<<8)
#define BLE_UART_CCOMMAND_BOOTLOADER_JUMP_BOOTLOADER                       (0x22<<8)
#define BLE_UART_CCOMMAND_BOOTLOADER_JUMP_APPLICATION                      (0x23<<8)
#define BLE_UART_CCOMMAND_BOOTLOADER_RESET                                 (0x24<<8)
#define BLE_UART_CCOMMAND_BOOTLOADER_BOOTSETTING                       (0x25<<8)
#define BLE_UART_CCOMMAND_BOOTLOADER_PREVALIDATE                       (0x26<<8)
#define BLE_UART_CCOMMAND_BOOTLOADER_IMAGE_DATA                        (0x27<<8)
#define BLE_UART_CCOMMAND_BOOTLOADER_IMAGE_WRITE                       (0x28<<8)
#define BLE_UART_CCOMMAND_BOOTLOADER_POSTVALIDATE                      (0x29<<8)
#define BLE_UART_CCOMMAND_BOOTLOADER_RESET_N_ACTIVATE                  (0x2A<<8)



#define BLE_UART_RESPONSE_BOOTLOADER_BLE_INFO                              (0xA1<<8)
#define BLE_UART_RESPONSE_BOOTLOADER_JUMP_BOOTLOADER                       (0xA2<<8)
#define BLE_UART_RESPONSE_BOOTLOADER_JUMP_APPLICATION                      (0xA3<<8)
#define BLE_UART_RESPONSE_BOOTLOADER_RESET                                 (0xA4<<8)
#define BLE_UART_RESPONSE_BOOTLOADER_BOOTSETTING                       (0xA5<<8)
#define BLE_UART_RESPONSE_BOOTLOADER_PREVALIDATE                       (0xA6<<8)
#define BLE_UART_RESPONSE_BOOTLOADER_IMAGE_DATA                        (0xA7<<8)
#define BLE_UART_RESPONSE_BOOTLOADER_IMAGE_WRITE                       (0xA8<<8)
#define BLE_UART_RESPONSE_BOOTLOADER_POSTVALIDATE                      (0xA9<<8)
#define BLE_UART_RESPONSE_BOOTLOADER_RESET_N_ACTIVATE                  (0xAA<<8)








#define BLE_UART_CCOMMAND_MASK_APPLICATION                                 ((1<<PC_UART_CCOMMAND_MASK_APPLICATION_POSITION)<<8|(UART_PACKET_HEADER))

#define BLE_UART_CCOMMAND_APPLICATION_UNSPPORT       		            			 ((0xFF)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_APP_ERROR      		            			 ((0xFE)<<8)
/*
命令
*/
#define BLE_UART_CCOMMAND_APPLICATION_INFO_APOLLO2                        ((0x11)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_APOLLO2_JUMP_BOOTLOADER             ((0x12)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_APOLLO2_JUMP_APPLICATION            ((0x13)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_APOLLO2_JUMP_UPDATE_ALGORITHM       ((0x14)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_APOLLO2_RESET                       ((0x15)<<8)
#ifdef SOS_ADVERTISING 
#define BLE_UART_CCOMMAND_APPLICATION_SOS_GPS                             ((0x16)<<8)				
#endif	
#ifdef COD
#define BLE_UART_CCOMMAND_APPLICATION_INFO_BAT                        	  ((0x17)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_CURRENT_TIME_READ                   ((0x18)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_LOCATION_INFO                  	  ((0x19)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_PHONE_CALL_STATUS                   ((0x1A)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_PHONE_CALL_DELAY                    ((0x1B)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_ON_BIND_DEVICE                      ((0x1C)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_SEND_BIND_STATUS                    ((0x1D)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_ON_SPORT_CAST                    	  ((0x1E)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_ON_TRAINING_CAST                    ((0x1F)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_RT_DATA_TRANS                    	  ((0x20)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_SENSOR_DATA_TRANS                   ((0x2B)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_REST_HEARTRATE                  	  ((0x2C)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_DATA_FRAME_NUM                  	  ((0x2D)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_DELETE_DATA                  	      ((0x2E)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_MAC_READ                  	      ((0x2F)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_MAC_WRITE                  	      ((0x3F)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_UPDATA_AGPS_TIME                 	  ((0x4A)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_UPDATA_BP_START                 	  ((0x4B)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_UPDATA_BP_FINISH                 	  ((0x4C)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_REAL_TIME_LOG_TRANS                 ((0x4D)<<8)
#endif

#define BLE_UART_CCOMMAND_APPLICATION_BLE_INFO                              ((0x21)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_JUMP_BOOTLOADER                       ((0x22)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_JUMP_APPLICATION                      ((0x23)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_RESET                                 ((0x24)<<8)
#define BLE_UART_CCOMMAND_BOOTLOADER_BOOTSETTING                            (0x25<<8)
#define BLE_UART_CCOMMAND_BOOTLOADER_PREVALIDATE                       			(0x26<<8)
#define BLE_UART_CCOMMAND_BOOTLOADER_IMAGE_DATA                        			(0x27<<8)
#define BLE_UART_CCOMMAND_BOOTLOADER_IMAGE_WRITE                       			(0x28<<8)
#define BLE_UART_CCOMMAND_BOOTLOADER_POSTVALIDATE                      			(0x29<<8)
#define BLE_UART_CCOMMAND_BOOTLOADER_RESET_N_ACTIVATE                  			(0x2A<<8)
#define BLE_UART_CCOMMAND_APPLICATION_BLE_CONNECT                         ((0x31)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_BLE_DISCONNECT                      ((0x32)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_BLE_BOND                            ((0x33)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_BLE_PASSKEY                         ((0x34)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_DEV_NAME_UPDATE                     ((0x35)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_CURRENT_TIME_WRITE                  ((0x36)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_WEATHER_INFO_REQUEST                ((0x37)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_PERSONAL_INFO_READ                  ((0x38)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_PERSONAL_INFO_WRITE                 ((0x39)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_SPORTS_PARAM_READ                   ((0x3A)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_SPORTS_PARAM_WRITE                  ((0x3B)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_APP_MESSAGE_IOS                     ((0x3C)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_APP_MESSAGE_ANDROID                 ((0x3D)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_WECHAT_SPORT_DATA_REQUEST           ((0x3E)<<8)

