xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/User/Command/cmd_apollo2.h
#define BLE_UART_CCOMMAND_APPLICATION_EXTFLASH_CONFIG_ASTRO_SYNC_REQUEST             					((0x41)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_EXTFLASH_CONFIG_MAIN_DAY_DATA_REQUEST          					((0x42)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_EXTFLASH_CONFIG_ACTIVITY_ADDRESS_REQUEST       					((0x43)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_EXTFLASH_CONFIG_ACTIVITY_ADDRESS_BOUNDARY_REQUEST       ((0x44)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_EXTFLASH_CONFIG_SHARD_TRACK_ADDRESS_REQUEST             ((0x48)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_EXTFLASH_CONFIG_SHARD_TRACK_HEADER_WRITE                ((0x49)<<8)

#define BLE_UART_CCOMMAND_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_REQUEST_UUID                			((0x51)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_READ_ADDRESS_REQUEST        			((0x52)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_WRITE_ADDRESS_REQUEST       			((0x53)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_RESULT_REQUEST_UUID         			((0x54)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_RESULT_READ_ADDRESS_REQUEST      ((0x55)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_RESULT_WRITE_ADDRESS_REQUEST     ((0x56)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_EXTFLASH_CONFIG_TRAIN_NOTIFY_SWITCH                    			((0x57)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_ERASE_ADDRESS_REQUEST       			((0x58)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_RESULT_ERASE_ADDRESS_REQUEST     ((0x59)<<8)

#define BLE_UART_CCOMAND_APPLICATION_SENSOR_DATA_UPLOAD  ((0x5a)<<8)

#define BLE_UART_CCOMMAND_APPLICATION_SCAN_ENABLE                         ((0x61)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_SCAN_DISABLE                        ((0x62)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_ACCESSORY_HEARTRATE_CONNECT         ((0x63)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_ACCESSORY_HEARTRATE_DISCONNECT      ((0x64)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_ACCESSORY_RUNNING_CONNECT           ((0x65)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_ACCESSORY_RUNNING_DISCONNECT        ((0x66)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_ACCESSORY_CYCLING_CONNECT           ((0x67)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_ACCESSORY_CYCLING_DISCONNECT        ((0x68)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_ACCESSORY_DATA_UPLOAD               ((0x69)<<8)


#define BLE_UART_CCOMMAND_APPLICATION_FIND_PHONE                          ((0x71)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_GET_WATCH_CALCULATE_PARAM_WRITE     ((0x72)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_GET_WATCH_CALCULATE_PARAM_READ      ((0x73)<<8)


#define BLE_UART_CCOMMAND_APPLICATION_WATCH_FACE_INFO                      ((0x74)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_WATCH_FACE_INFO_2                    ((0x75)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_WATCH_FACE_FINISH                    ((0x76)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_WATCH_FACE_ACTIVATE                  ((0x77)<<8)



#define BLE_UART_CCOMMAND_APPLICATION_FIND_WATCH                           ((0x79)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_GET_WATCH_DEFAULT_SPORT_MODE         ((0x7A)<<8)
#define BLE_UART_CCOMMAND_APPLICATION_SEND_GPS_TEST_DATA         		   ((0x7B)<<8)



#define BLE_UART_CCOMMAND_APPLICATION_NOTIFY_MSG_ACTION_PERFORM           	((0x01)<<8)//来电通知接听或者挂断



/*
响应
*/
#define BLE_UART_RESPONSE_APPLICATION_INFO_APOLLO2                        ((0x91)<<8)
#define BLE_UART_RESPONSE_APPLICATION_APOLLO2_JUMP_BOOTLOADER             ((0x92)<<8)
#define BLE_UART_RESPONSE_APPLICATION_APOLLO2_JUMP_APPLICATION            ((0x93)<<8)
#define BLE_UART_RESPONSE_APPLICATION_APOLLO2_JUMP_UPDATE_ALGORITHM       ((0x94)<<8)
#define BLE_UART_RESPONSE_APPLICATION_APOLLO2_RESET                       ((0x95)<<8)
#ifdef COD
#define BLE_UART_RESPONSE_APPLICATION_INFO_BAT                        	  ((0x96)<<8)
#define BLE_UART_RESPONSE_APPLICATION_CURRENT_TIME_READ                   ((0x97)<<8)
#define BLE_UART_RESPONSE_APPLICATION_LOCATION_INFO              	      ((0x98)<<8)
#define BLE_UART_RESPONSE_APPLICATION_PHONE_CALL_STATUS              	  ((0x99)<<8)
#define BLE_UART_RESPONSE_APPLICATION_PHONE_CALL_DELAY              	  ((0x9A)<<8)
#define BLE_UART_RESPONSE_APPLICATION_PHONE_CALL_CTRL             	      ((0x9B)<<8)
#define BLE_UART_RESPONSE_APPLICATION_ON_BIND_DEVICE             	      ((0x9C)<<8)
#define BLE_UART_RESPONSE_APPLICATION_SEND_BIND_STATUS              	  ((0x9D)<<8)
#define BLE_UART_RESPONSE_APPLICATION_CMD_CAST                    		  ((0x9E)<<8)
#define BLE_UART_RESPONSE_APPLICATION_RT_TODAY                    		  ((0x9F)<<8)
#define BLE_UART_RESPONSE_APPLICATION_RT_HEART                    		  ((0xA0)<<8)
#define BLE_UART_RESPONSE_APPLICATION_SPORT_CTRL                    	  ((0xAB)<<8)
#define BLE_UART_RESPONSE_APPLICATION_SENSOR_DATA_TRAINS                  ((0xAC)<<8)
#define BLE_UART_RESPONSE_APPLICATION_REST_HEARTRATE                 	  ((0xAD)<<8)
#define BLE_UART_RESPONSE_APPLICATION_DATA_FRAME_NUM                 	  ((0xAE)<<8)
#define BLE_UART_RESPONSE_APPLICATION_DELETE_DATA                 	  	  ((0xAF)<<8)
#define BLE_UART_RESPONSE_APPLICATION_MAC_READ                	  		  ((0xCA)<<8)
#define BLE_UART_RESPONSE_APPLICATION_MAC_WRITE                	  	  	  ((0xCB)<<8)
#define BLE_UART_RESPONSE_APPLICATION_UPDATA_BP_START                 	  ((0xCC)<<8)
#define BLE_UART_RESPONSE_APPLICATION_REAL_TIME_LOG_TRAINS                ((0xCD)<<8)

#endif
#ifdef WATCH_QIWEI_SPORT_DATA
#define BLE_UART_RESPONSE_APPLICATION_SPORT_DATA_UPLOAD                  ((0xCE)<<8)
#endif
#define BLE_UART_RESPONSE_APPLICATION_BLE_INFO                              ((0xA1)<<8)
#define BLE_UART_RESPONSE_APPLICATION_JUMP_BOOTLOADER                       ((0xA2)<<8)
#define BLE_UART_RESPONSE_APPLICATION_JUMP_APPLICATION                      ((0xA3)<<8)
#define BLE_UART_RESPONSE_APPLICATION_RESET                                 ((0xA4)<<8)
#define BLE_UART_RESPONSE_BOOTLOADER_BOOTSETTING                       			(0xA5<<8)
#define BLE_UART_RESPONSE_BOOTLOADER_PREVALIDATE                       			(0xA6<<8)
#define BLE_UART_RESPONSE_BOOTLOADER_IMAGE_DATA                        			(0xA7<<8)
#define BLE_UART_RESPONSE_BOOTLOADER_IMAGE_WRITE                       			(0xA8<<8)
#define BLE_UART_RESPONSE_BOOTLOADER_POSTVALIDATE                      			(0xA9<<8)
#define BLE_UART_RESPONSE_BOOTLOADER_RESET_N_ACTIVATE                  			(0xAA<<8)
#define BLE_UART_RESPONSE_APPLICATION_BLE_CONNECT                         ((0xB1)<<8)
#define BLE_UART_RESPONSE_APPLICATION_BLE_DISCONNECT                      ((0xB2)<<8)
#define BLE_UART_RESPONSE_APPLICATION_BLE_BOND                            ((0xB3)<<8)
#define BLE_UART_RESPONSE_APPLICATION_BLE_PASSKEY                         ((0xB4)<<8)
#define BLE_UART_RESPONSE_APPLICATION_BLE_DEV_NAME_UPDATE                 ((0xB5)<<8)
#define BLE_UART_RESPONSE_APPLICATION_CURRENT_TIME_WRITE                  ((0xB6)<<8)
#define BLE_UART_RESPONSE_APPLICATION_WEATHER_INFO_REQUEST                ((0xB7)<<8)
#define BLE_UART_RESPONSE_APPLICATION_PERSONAL_INFO_READ                  ((0xB8)<<8)
#define BLE_UART_RESPONSE_APPLICATION_PERSONAL_INFO_WRITE                 ((0xB9)<<8)
#define BLE_UART_RESPONSE_APPLICATION_SPORTS_PARAM_READ                   ((0xBA)<<8)
#define BLE_UART_RESPONSE_APPLICATION_SPORTS_PARAM_WRITE                  ((0xBB)<<8)
#define BLE_UART_RESPONSE_APPLICATION_APP_MESSAGE_IOS                     ((0xBC)<<8)
#define BLE_UART_RESPONSE_APPLICATION_APP_MESSAGE_ANDROID                 ((0xBD)<<8)
#define BLE_UART_RESPONSE_APPLICATION_WECHAT_SPORT_DATA_REQUEST           ((0xBE)<<8)

#define BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_ASTRO_SYNC_REQUEST             					((0xC1)<<8)
#define BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_MAIN_DAY_DATA_REQUEST          					((0xC2)<<8)
#define BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_ACTIVITY_ADDRESS_REQUEST       					((0xC3)<<8)
#define BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_ACTIVITY_ADDRESS_BOUNDARY_REQUEST       ((0xC4)<<8)
#define BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_SHARD_TRACK_ADDRESS_REQUEST             ((0xC8)<<8)
#define BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_SHARD_TRACK_HEADER_WRITE                ((0xC9)<<8)


